Revit 2026 API

# AssetPropertyDoubleArray4d Class

---

Represents a color property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyDoubleArray4d

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyDoubleArray4d : AssetProperty
```
```vb
Public Class AssetPropertyDoubleArray4d
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyDoubleArray4d : public AssetProperty
```
```fsharp
type AssetPropertyDoubleArray4d =
    class
        inherit AssetProperty
    end
```

The AssetPropertyDoubleArray4d type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. (Inherited from AssetProperty) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssetProperty) |
|  | Name | Get the name of the AssetProperty(Inherited from AssetProperty) |
|  | NumberOfConnectedProperties | The number of currently connected properties. (Inherited from AssetProperty) |
|  | Type | Returns the type of the AssetProperty(Inherited from AssetProperty) |

|  | Name | Description |
| --- | --- | --- |
|  | AddConnectedAsset | Adds a new connected asset attached to this asset property, if it allows it. (Inherited from AssetProperty) |
|  | AddCopyAsConnectedAsset | Makes a copy of the asset and connects it to this property. (Inherited from AssetProperty) |
|  | Dispose | (Inherited from AssetProperty) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAllConnectedProperties | Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime. (Inherited from AssetProperty) |
|  | GetConnectedProperty | Gets one connected property with specified index. (Inherited from AssetProperty) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSingleConnectedAsset | Gets the single connected asset attached to this asset property, if it exists. (Inherited from AssetProperty) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetValueAsColor | Gets the value property as a color. |
|  | GetValueAsDoubles | Gets the value property as doubles. |
|  | IsEditable | Check if property can be edited. (Inherited from AssetProperty) |
|  | IsValidSchemaIdentifier | Check that schema name is valid (Inherited from AssetProperty) |
|  | IsValidValue(Color) | Checks that the value is a valid value for this property. |
|  | IsValidValue(IListDouble) |  |
|  | RemoveConnectedAsset | Removes the connected asset attached to this asset property if any. (Inherited from AssetProperty) |
|  | SetValueAsColor | Sets the value property as a color. |
|  | SetValueAsDoubles |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Visual Namespace